from gtts import gTTS
import os
katet1 = 4
gipo = 5

katet2 = 3
ploshcha = (katet2*katet1)/2
P = katet2+katet1+gipo

text = (f"Дано прямокутний трикутник з відомим катетом який = 4 сантиметрів і гіпотенузою яка = 5 сантиметрів"
        f"знайти невідомий катет, площу та периметр цього трикутника"
        f"Для того щоб знайти невідомий катет потрібно від квадрату гіпотенузи відняти квадрат відомого катета"
        f"тобто 25 - 16 = 9 а потім взяти квадратний корінь із отриманого значення = {katet2}"
        f"далі площа прямокутного трикутника = половині добутку його катетів тобто {katet1} помножити на {katet2} і це все поділити на 2 = {ploshcha}"
        f"щоб знайти периметр потрібно додати всі сторони трикутника тобто {katet2}+{katet1}+{gipo} = {P}")
tts = gTTS(text, lang="ru")

# Сохранить в файл
tts.save("output.mp3")

# Воспроизвести
os.system("start output.mp3")

print(katet2)
print(ploshcha)
print(P)